Repository: 84000/data-translation-memory
Catalog: Toh_357-The_Prophecy_on_Mount_Gosrnga-v.2.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་སེམས་ཡོངས་སུ་དག་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་དང་། སྙོམས་པར་འཇུག་པ་དང་། ས་དང་། སྟོབས་དང་། ཐུགས་རྗེ་དང་། བྱམས་པ་ཆེན་པོ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཐེ་ཚོམ་སེལ་བ་དང་། སངས་རྒྱས་ཉིད་ལས་མི་ལྡོག་པ་དང་། ཏིང་ངེ་འཛིན་དང་། མངོན་པར་རྟོགས་པ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་། མ་འདྲེས་པ་དང་། སངས་རྒྱས་ཉིད་དུ་འགྱུར་བ་དང་། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། སྟོང་པ་དང་། མ་བྱས་པ་དང་། མ་སྐྱེས་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པ་དང་། ཡང་དག་པའི་མཐའ་དང་། དེ་བཞིན་གཤེགས་པའི་སྙིང་པོའི་ཁོངས་སུ་གཏོགས་པ་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་རྟོགས་པ་དང་། རྣལ་འབྱོར་པ་རྣམས་ཀྱིས་སོ་སོ་རང་གིས་རིག་པའི་སྤྱོད་ཡུལ་དང་། སྐྱེ་བ་སྡུག་བསྔལ་བ་དང་། རྒ་བ་དང་། སྡུག་པ་དང་བྲལ་བ་དང་། མི་སྡུག་པ་དང་ཕྲད་པ་དང་། འདོད་པ་བཙལ་ཏེ་མ་རྙེད་པའི་སྡུག་བསྔལ་གྱི་སྒྲ་ཡང་བྱུང་བར་གྱུར་ཏོ། །
en: Moreover, there also arose sounds pertaining to the pure mind; the branches of awakening; the noble path; the attainments; the strength of the spiritual levels; great compassion and love; dependent origination; dispelling doubt; proceeding irreversibly toward buddhahood; meditative absorption; clear realization; acceptance that phenomena are unborn; the distinct qualities; the transformation into buddhahood; the impermanent, unsatisfactory, selfless, and empty; the unproduced; the unborn; the unmistaken; the limit of reality; the realization of nonconceptual wisdom that is implicit in buddha nature; the domain of the personally realized self-awareness of practitioners; and the sufferings of birth, aging, parting from what is dear, encountering what is disliked, and being unable to fulfill one’s desires.

source: གཞན་ཡང་ཕུང་པོ་ལྔ་པོ་དག་ལ་སེམས་ཅན་མེད་པ་དང་། གསོ་བ་དང་། གང་ཟག་དང་། སྲོག་མེད་པ་དང་། ཆོས་བདེན་པ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། རྟག་པ་མེད་པ་དང་། ཆད་པ་མེད་པ། འོང་བ་མེད་པ། འགྲོ་བ་མེད་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་དང་། བྱིན་གྱིས་བརླབས་དང་། འགྲོ་བ་ལྔ་པོ་དག་གི་འཁྲུལ་བ་རྨི་ལམ་ལྟ་བུ་དང་། འཁོར་བའི་འདུ་བྱེད་བཙོན་ར་ལྟ་བུ་དང་། སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། བྲག་ཅ་ལྟ་བུའོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་བར་གྱུར་ཏེ
en: Moreover, the following sounds occurred: “within the five aggregates there is no sentient being, nor any soul, person, or life-force”; “the truth of phenomena is that all things are without birth, without cessation, without permanence, without annihilation, without coming, and without going”; the lineage of the Three Jewels; blessings; and “the delusion of the five types of beings is like a dream, and the formations of cyclic existence are like a prison, and like an illusion, a mirage, a reflection of the moon in water, and an echo.”

source: གཞན་ཡང་དད་པ་དང་མངོན་པར་རྟོགས་པ་དང་། བརྩོན་འགྲུས་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། འཁོར་བས་སྐྱོ་བ་དང་། དེ་ལྟ་བུ་ལ་སོགས་པ་སྒྲ་བརྒྱ་སྟོང་དུ་མ་བྱུང་བར་གྱུར་ཏོ། །
en: Moreover, the following other sounds occurred: “faith”; “clear realization”; “diligence”; “the path of the ten virtuous deeds”; “disenchantment with saṃsāra”; and hundreds, as well as thousands of other such sounds.

source: དེ་ནས་འཁོར་འདུས་པ་མང་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་ཕྱོགས་ནས་ལྷགས་པ་དེ་དག་ཐམས་ཅད་ས་ལ་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། ནམ་མཁའ་ལ་གནས་པའི་ལྷ་དང་། གནོད་སྦྱིན་ཐམས་ཅད་སེམས་ངོ་མཚར་དུ་གྱུར་ནས་རངས་པ་སྐྱེས་ཏེ
en: All of the many assembled retinues, as well as the bodhisattvas who had arrived there from various other places, the gods and nāgas living on the earth, and the celestial gods and yakṣas, were all filled with wonder and rapture and

source: ཆོས་ཀྱི་སྒོ་མོའི་སྒྲ་དེ་དག་ལ་ཡིད་མི་ཕྱེད་པར་གྱུར་ཏོ། །
en: they gained confidence in those sounds of gateways of Dharma.

source: དེ་ནས་དེའི་ཚེ་འཁོར་དེ་དག་གི་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: In order to facilitate their understanding, the bodhisattva great being Mañjuśrī­kumāra­bhūta then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཆོ་འཕྲུལ་ཆེན་པོ་འདི་ལྟ་བུ་བསྟན་པ་ལགས།
en: “Blessed One, for what purpose was this great miracle displayed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པའི་དབྱངས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied in a voice like that of Brahmā:

source: འཇམ་དཔལ་ཆོས་ཀྱི་སྒོ་མོ་འདི་དག་ནི་ཡུལ་དགེ་བ་ནས་སྐྱེ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དང་། འཁོར་བཞི་པོ་རྣམས་ཀྱི་ཆེད་དུ་ཡང་ལྷག་པར་བྱིན་གྱིས་བརླབས་ནས་བསྟན་པ་ཡིན་ཏེ
en: “Mañjuśrī, these gateways of Dharma, which yield great blessings, were taught for the benefit of those who are to be born in the land of Virtue and for the benefit of the fourfold retinue.

source: ཆོས་ཀྱི་སྒོ་མོ་འདིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཚེགས་ཆུང་ངུ་དང་། འབད་པ་ཆུང་ངུས་དབང་པོ་དང་། ཤེས་པ་ཡོངས་སུ་དག་པར་འགྱུར་ཞིང་།
en: Through these gateways of Dharma, bodhisattvas will purify their faculties and consciousness with only a little hardship and a little effort and

source: ཆོས་ཀྱི་སྒོ་མོ་དེ་དང་དེ་དག་ཀྱང་མངོན་པར་རྟོགས་པར་འགྱུར་རོ། །
en: they will come to directly realize these gateways of Dharma.

source: མ་འོངས་པའི་སྐྱེ་བོ་དེ་དག་ནི་བྱིས་པ་ཆུང་ངུ་ཡན་ཅད་ཆོས་མངོན་པར་རྟོགས་པར་དགའ་ཞིང་རྩེད་མོར་ཡང་ཆོས་ཀྱི་སྒོ་མོ་འདི་དག་སྨྲ་བར་འགྱུར་རོ། །
en: Beings of the future, from young children upward, will take joy in the realization of the Dharma and they will talk about these gateways of Dharma even in their games.

source: སེམས་ཅན་དེ་དག་དབང་པོ་ཡོངས་སུ་བརྟས་ནས་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཐོང་བར་འགྱུར།
en: Such sentient beings, by developing their faculties in this way, will purify the eye of Dharma and will thereby behold the bodies of the thus-gone ones.

source: ཆོས་ཀྱི་རྣ་བ་རྣམ་པར་དག་པས་ཆོས་ཡང་དག་པར་ནོད་པ་ཡང་ཐོས་པར་འགྱུར།
en: Purifying the ear of Dharma, they will hear and receive the Dharma.

source: དེ་དག་འཁོར་བ་ན་འདུ་བྱེད་དང་ཆོས་ཐམས་ཅད་ལས་ཀྱང་སེམས་རྣམ་པར་གྲོལ་བར་འགྱུར་ཏེ།
en: Their minds will be freed from all the formations and phenomena in saṃsāra.

source: སེམས་དེ་ལྟ་བུ་དེས་ན་ཡུལ་དགོན་པ་བྱིན་གྱིས་བརླབས་པ་འདིར་དགེ་བའི་ཕྱོགས་ལ་བརྩོན་པའམ།
en: With such minds, they will exert themselves in virtue here in this blessed wilderness, or

source: ཡང་ན་རི་གླང་རུ་ལ་གནས་པ་དེ་དག་ཐམས་ཅད་དངོས་གྲུབ་ཐོབ་པར་འགྱུར་ཏེ།
en: they will live on Mount Gośṛṅga and will all gain realization there.

source: བདུད་སྡིག་ཅན་གྱིས་ཀྱང་གླགས་མི་རྙེད་ན་གཞན་དག་གིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Evil Māra himself will be unable to harm them, let alone anyone else.

source: འདི་ལྟ་སྟེ།
en: It is like this.

source: ལྷ་རྣམས་ཀྱིས་འཁོར་གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། མིའམ་ཅི་ཆད་པས་བཅད་པར་འགྱུར་ན
en: Even if the gods were to penalize and punish the retinues of yakṣas, gandharvas, or kinnaras,

source: འང་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། རི་གླང་རུ་ལ་འཁྲས་ན་
en: if these beings were to take shelter at the Gomasalaganda stūpa and Mount Gośṛṅga,

source: དེ་དག་གིས་མི་མཐོང་བར་འགྱུར་རོ། །
en: the gods would be unable to see them.

source: བརྒྱ་ལ་མཐོང་ན་ཡང་སེམས་ཞི་བར་འགྱུར་ཏེ།
en: Even if they should happen to see them, their minds would become peaceful.

source: རྒྱུ་དེས་ན་རི་གླང་རུ་དང་། མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ནི་མཚམས་བཅད་པ་དང་། གཙང་བྱེད་དང་། སྐྱབས་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་ཕྱག་བྱ་བར་འོས་པ་ཡིན་ནོ། །
en: For this reason, Mount Gośṛṅga and the Gomasalaganda stūpa are an asylum, a sanctuary, and a haven. They are worthy of homage by beings living in other worlds.

source: མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། རི་གླང་རུ་དང་། ཡུལ་དགེ་བ་དང་། མཁར་དགེ་བ་ཅན་དང་། དགོན་པ་བྱིན་གྱིས་བརླབས་བརླབས་པའི་མིང་ཐོས་ནས་དད་པ་སྐྱེས་པ་ཙམ་གྱིས་ཀྱང་སྡིག་པ་ཆེན་པོ་འབྱང་བར་འགྱུར་རོ། །
en: Simply to feel faith upon hearing the names of the Gomasalaganda stūpa, Mount Gośṛṅga, the land of Virtue, Virtuous Castle, and the blessed hermitages will purify grave misdeeds.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། རྣམ་ཐོས་ཀྱི་བུ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then told venerable Śāriputra and Vaiśravaṇa,

source: རིགས་ཀྱི་བུ་ཁྱེད་གཉིས་སོང་ལ་མཚོ་ཆེན་པོ་འདི་ཤའི་རི་དྲོལ་ཏེ། བྱང་ཕྱོགས་ལོགས་སུ་གྱི་ཤོ་གཙང་པོའི་ནང་དུ་ཕོ་ལ་
en: “Noble sons, you two go and cut down Sha Mountain and transfer this large lake into the Gyisho River in the north.

source: ཆུ་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་མི་གནོད་པར་སྲུང་བ་དང་།
en: Thus, without harming any beings living in the water,

source: ཡུལ་འདིས་མཚམས་མངོན་པར་གྱིས་ཤིག །
en: you must guard and demarcate this land.”

source: དེ་ནས་ཉན་ཐོས་ཆེན་པོ་ཤཱ་རིའི་བུ་དང་རྣམ་ཐོས་ཀྱི་བུས་དེ་བཞིན་འཚལ་ལོ་ཞེས་གསོལ་ནས་
en: The great hearer Śāriputra and Vaiśravaṇa said in response, “We shall do as you instruct.” Then

source: རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལས་ཤའི་རི་གང་ན་བ་དེ་ལོགས་སུ་ཆས་ཏེ
en: they flew miraculously through the sky in the direction of Sha Mountain.

source: ཤཱ་རིའི་བུས་ནི་ལག་ན་ཁར་གསིལ་ཐོགས།
en: Śāriputra held in his hand a staff and

source: རྣམ་ཐོས་ཀྱི་བུས་ནི་ལག་ན་མདུང་ཐོགས་ནས་
en: Vaiśravaṇa held a spear, and

source: ཤའི་རི་ཕྱེད་སྟམ་པས་བླངས་ཏེ།
en: with these they cleaved Sha Mountain into two, picked up the pieces, and

source: ནུབ་ཕྱོགས་ལོགས་སུ་བཞག་ནས་
en: placed them down in the west. Thus,

source: ཆུ་སྲོལ་ཆེན་པོ་བཏོད་དེ་མཚོ་སྲོག་ཆགས་དང་བཅས་པར་གྱི་ཤོ་གཙང་པོའི་ནང་དུ་ཕོ་སྟེ།
en: they created a large riverbank through which the lake with all the animals living therein was diverted into the Gyisho River.

source: ཚུལ་དེ་ལྟ་བུས་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་དང་། རི་གླང་རུ་དང་། ལི་ཡུལ་དེ་མངོན་པར་བྱས་སོ། །
en: In this manner, the Gomasalaganda stūpa, Mount Gośṛṅga, and the land of Khotan were brought into being.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་དྲང་སྲོང་དང་བཅས་པ་དང་། རྣམ་ཐོས་ཀྱི་བུ་དང་ཁྱིམ་གཅིག་ལ་སོགས་པ་ལྷ་ཆེན་པོ་བརྒྱད་དང་། འཁོར་སུམ་ཁྲི་ལྔ་སྟོང་ལྔ་བརྒྱ་དང་བཅས་པ་ལ་མཆོད་རྟེན་གོ་མ་ས་ལ་གན་ད་ལ་སོགས་པ་ཡོངས་སུ་གཏད་དེ
en: At this point, the Blessed One entrusted the Gomasalaganda stūpa and the other places to the eight bodhisattva great beings such as noble Avalokiteśvara and Maitreya, the twenty thousand bodhisattvas, the sages, the eight great gods such as Vaiśravaṇa and Gṛhadāha, and the remaining retinue of thirty-five thousand five hundred beings.

source: ལྷ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་དུ་མནོས་སོ། །
en: All of the gods also accepted this entrustment.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་གནང་ངོ་། །
en: The Blessed One bestowed it accordingly.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: When the Blessed One had thus spoken,

source: འཁོར་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ།། །།
en: the entire assembly rejoiced and praised what the Blessed One had said.

source: འཕགས་པ་གླང་རུ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes The Noble Great Vehicle Sūtra “The Prophecy on Mount Gośṛṅga.”
